AccumulationRegisters/СМГ_КомплектацияАвтомобилейАвтоработы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>СМГ_КомплектацияАвтомобилейАвтоработы</Name>
			<Comment>СМГ комплектация автомобилей автоработы</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Comment>Работа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором была выполнена работа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/КомплектацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>КомплектацияАвтомобилей</Name>
			<Comment>Комплектация автомобилей дополнительным оборудованием</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Comment>Сумма продажи в регламентированной валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажиУпр</Name>
					<Comment>Сумма продажи в управленческой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Опции</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Автоработы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Автоработы</Name>
			<Comment>Автоработы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер автоработы по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование автоработы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Базовая номенклатура автоработы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Comment>Время выполнения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_ВидНормировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_СложностьРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OPERACODE_СложностьРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_ВидРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OPERACODE_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОкраска</Name>
					<Comment>Это окраска</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеПредложение</Name>
					<Comment>Признак того что эта авторабота является дополнительным предложением</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьДанныеВЗаявкеНаРемонт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нормочас</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПакетДляКомплектации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НормыВремени</Name>
					<Comment>Нормы времени выполнения работы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Comment>Вариант комплектации автомобиля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормыРасходаМатериалов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/СМГ_КомплектацияАвтомобилейАвтоработы/Ext/RecordSetModule.bsl
Перем РежимПроведения Экспорт; // Режим проведения документа. Если проведение неоперативное - проверок остатков нет

Перем ДокументОбъект Экспорт; //Документ, осуществляющий движение по регистру
Перем РезультатЗапросаПоРаботам Экспорт; //Выборка табличной части или таблица значений табличной части товаров
Перем Автомобиль Экспорт; //Ссылка на автомобиль, комплектация которого производится. Если значение неопределено автомобиль находится в табличной части товаров
Перем ПериодДвижения Экспорт; //Период движения регистра. Если период не задан, он берется из ДокументОбъект.Дата
Перем ТипОборудования Экспорт; //Название справочника автоработы
Перем ШапкаДокумента Экспорт; // Выборка или строка таблицы значений, в которой содержаться необходимые данные о шапке документа
Перем СторноПриход Экспорт; // Флаг используется в функции Расход() и означает, что будет операция не расхода, а сторно.

////////////////////////////////////////////////////////////////////////
//Функции модуля набора записей

// Формирует движения по регистру приход (увеличение СМГ комплектации автомобиля работы)
// Возвращаемое значение: Булево. Истина - все ОК, Ложь - ошибка.
Функция Приход() Экспорт
	
	ВсеОК=Истина;
	
	ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(); 
	СтруктураКурса = обКурсДляВалюты(ВалютаРегл,ШапкаДокумента.МоментВремени);
	КурсРегл	   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить(); 
	Попытка
		КурсУпр=ШапкаДокумента.КурсВалютыУпр;
	Исключение
		КурсУпр=Неопределено;
	КонецПопытки; 
	Если КурсУпр=Неопределено ИЛИ обЗначениеНеЗаполнено(КурсУпр) Тогда
		СтруктураКурса = обКурсДляВалюты(ВалютаУпр,ШапкаДокумента.МоментВремени);
		КурсУпр		   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	КонецЕсли;
	ПериодДвижения=?(ПериодДвижения=Неопределено,ШапкаДокумента.Дата,ПериодДвижения);
	
	//Перебираем строки товаров
	Для Каждого СтрокаРабот Из РезультатЗапросаПоРаботам Цикл
		НоваяЗапись=Добавить();
		НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
		НоваяЗапись.Период=ПериодДвижения;
		НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
		НоваяЗапись.Автомобиль=?(Автомобиль=Неопределено,СтрокаРабот.Автомобиль,Автомобиль);
 		НоваяЗапись.Работа=СтрокаРабот.Авторабота;
 		НоваяЗапись.Количество=СтрокаРабот.Количество;
  		Попытка
			СуммаУпр=СтрокаРабот.СуммаУпр;
		Исключение
			СуммаУпр=Окр(обПересчет(СтрокаРабот.Сумма,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр),2);
		КонецПопытки; 
		НоваяЗапись.СуммаУпр=Окр(СуммаУпр,2);
 	КонецЦикла; 
	
	// запись движений
	Если ВсеОК Тогда Записать(); КонецЕсли; 
	
	ДокументОбъект=Неопределено;
	ШапкаДокумента=Неопределено;
	РезультатЗапросаПоРаботам=Неопределено;
	Автомобиль=Неопределено;
 	
	Возврат ВсеОК;
	
КонецФункции

// Формирует движения по регистру расход (уменьшение комплектации автомобиля)
// Возвращаемое значение: Булево. Истина - все ОК, Ложь - ошибка.
Функция Расход() Экспорт
	ВсеОК=Истина;
	
	ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(); 
	СтруктураКурса = обКурсДляВалюты(ВалютаРегл,ШапкаДокумента.МоментВремени);
	КурсРегл	   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить(); 
	Попытка
		КурсУпр=ШапкаДокумента.КурсВалютыУпр;
	Исключение
		КурсУпр=Неопределено;
	КонецПопытки; 
	Если КурсУпр=Неопределено ИЛИ обЗначениеНеЗаполнено(КурсУпр) Тогда
		СтруктураКурса = обКурсДляВалюты(ВалютаУпр,ШапкаДокумента.МоментВремени);
		КурсУпр		   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	КонецЕсли;
	ПериодДвижения=?(ПериодДвижения=Неопределено,ШапкаДокумента.Дата,ПериодДвижения);
	
	СторноПриход = ?(СторноПриход=Неопределено, Ложь, СторноПриход);
	
	// получим таблицу товарного состава
	Если (РезультатЗапросаПоРаботам=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоРаботам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоРаботам)<>Тип("ТаблицаЗначений")) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	КомплектацияАвтомобилейОстатки.Работа КАК Работа,
		             |	СУММА(КомплектацияАвтомобилейОстатки.КоличествоОстаток) КАК Количество,
		             |	СУММА(КомплектацияАвтомобилейОстатки.СуммаУпрОстаток) КАК СуммаУпр
		             |ИЗ
		             |	РегистрНакопления.СМГ_КомплектацияАвтомобилейАвтоработы.Остатки(
		             |			&НаДату,
		             |			Автомобиль = &Автомобиль
		             |				И Организация = &Организация) КАК КомплектацияАвтомобилейОстатки
		             |ГДЕ
		             |	КомплектацияАвтомобилейОстатки.Работа ССЫЛКА Справочник.Автоработы
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	КомплектацияАвтомобилейОстатки.Работа";
		Запрос.УстановитьПараметр("НаДату",ПериодДвижения);
		Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
		Запрос.УстановитьПараметр("Организация",ДокументОбъект.Организация);
		РезультатЗапросаПоРаботам=Запрос.Выполнить();
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоРаботам)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоРаботам=РезультатЗапросаПоРаботам.Выгрузить();
	КонецЕсли;
	ВремРезультатЗапросаПоРаботам=РезультатЗапросаПоРаботам.Скопировать();
	ЕстьПартия=ВремРезультатЗапросаПоРаботам.Колонки.Найти("Партия")<>Неопределено;
	ЕстьГТД=ВремРезультатЗапросаПоРаботам.Колонки.Найти("ГТД")<>Неопределено;
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	КомплектацияАвтомобилейОстатки.Номенклатура КАК Номенклатура,
	             |	КомплектацияАвтомобилейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |	КомплектацияАвтомобилейОстатки.СтатусПартии КАК СтатусПартии,
	             |	КомплектацияАвтомобилейОстатки.Партия КАК Партия,
	             |	КомплектацияАвтомобилейОстатки.СкладКомпании КАК СкладКомпании,
	             |	КомплектацияАвтомобилейОстатки.ГТД КАК ГТД,
	             |	СУММА(КомплектацияАвтомобилейОстатки.КоличествоОстаток) КАК Количество,
	             |	СУММА(КомплектацияАвтомобилейОстатки.СуммаОстаток) КАК Сумма,
	             |	СУММА(КомплектацияАвтомобилейОстатки.СуммаНДСОстаток) КАК СуммаНДС,
	             |	СУММА(КомплектацияАвтомобилейОстатки.СуммаУпрОстаток) КАК СуммаУпр,
				 |	СУММА(КомплектацияАвтомобилейОстатки.СуммаПродажиОстаток) КАК СуммаПродажи,
				 |	СУММА(КомплектацияАвтомобилейОстатки.СуммаПродажиУпрОстаток) КАК СуммаПродажиУпр
	             |ИЗ
	             |	РегистрНакопления.КомплектацияАвтомобилей.Остатки(
	             |		&НаДату,
				 |		Автомобиль = &Автомобиль И
				 //|		СкладКомпании = &СкладКомпании И
				 |		СкладКомпании.Организация = &Организация И
	             |		Номенклатура В (&Номенклатура) И
	             |		ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)) КАК КомплектацияАвтомобилейОстатки
	             |ГДЕ
				 |	КомплектацияАвтомобилейОстатки.Номенклатура ССЫЛКА Справочник."+ТипОборудования+"
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	КомплектацияАвтомобилейОстатки.Номенклатура,
	             |	КомплектацияАвтомобилейОстатки.ХарактеристикаНоменклатуры,
	             |	КомплектацияАвтомобилейОстатки.СтатусПартии,
	             |	КомплектацияАвтомобилейОстатки.Партия,
	             |	КомплектацияАвтомобилейОстатки.СкладКомпании,
	             |	КомплектацияАвтомобилейОстатки.ГТД
				 |";
	Запрос.УстановитьПараметр("НаДату",ПериодДвижения);
	Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация); // Семенихин 24.05.2018: отбор по организации
	//Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	Запрос.УстановитьПараметр("Номенклатура",ВремРезультатЗапросаПоРаботам.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ВремРезультатЗапросаПоРаботам.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
	ВыборкаПоКомплектации=Запрос.Выполнить().Выгрузить();
	
	//Перебираем строки товаров
	Для Каждого СтрокаРабот Из ВремРезультатЗапросаПоРаботам Цикл
		СтруктураОтбораТоваров=Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",СтрокаРабот.Номенклатура,СтрокаРабот.ХарактеристикаНоменклатуры);
		Если ЕстьПартия И НЕ обЗначениеНеЗаполнено(СтрокаРабот.Партия) Тогда
			СтруктураОтбораТоваров.Вставить("Партия",СтрокаРабот.Партия);
		КонецЕсли; 
		Если ЕстьГТД И НЕ обЗначениеНеЗаполнено(СтрокаРабот.ГТД) Тогда
			СтруктураОтбораТоваров.Вставить("ГТД",СтрокаРабот.ГТД);
		КонецЕсли; 
		СтрокиНоменклатурыКомплектации=ВыборкаПоКомплектации.НайтиСтроки(СтруктураОтбораТоваров);
		Количество=СтрокаРабот.Количество;
		КоличествоУстановлено=0;
		Для Каждого СтрокаКомплектации Из СтрокиНоменклатурыКомплектации Цикл
			Если Количество=0 Тогда
				Прервать;
			КонецЕсли;
			КоличествоСписания=Мин(Количество,СтрокаКомплектации.Количество);
			НоваяЗапись=Добавить();
			НоваяЗапись.ВидДвижения=?(СторноПриход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
			НоваяЗапись.Период=ШапкаДокумента.Дата;
			НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
			НоваяЗапись.Автомобиль=Автомобиль;
			НоваяЗапись.СкладКомпании=СтрокаКомплектации.СкладКомпании; // Семенихин 24.05.2018: не обязательно СкладКомпании!
			НоваяЗапись.Номенклатура=СтрокаКомплектации.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры=СтрокаКомплектации.ХарактеристикаНоменклатуры;
			НоваяЗапись.СтатусПартии=СтрокаКомплектации.СтатусПартии;
			НоваяЗапись.Партия=СтрокаКомплектации.Партия;
			НоваяЗапись.ГТД=СтрокаКомплектации.ГТД;
			НоваяЗапись.Количество=КоличествоСписания;
			Если СтрокаКомплектации.Количество<=Количество Тогда
				НоваяЗапись.Сумма=Окр(СтрокаКомплектации.Сумма,2);
				НоваяЗапись.СуммаНДС=Окр(СтрокаКомплектации.СуммаНДС,2);
				НоваяЗапись.СуммаУпр=Окр(СтрокаКомплектации.СуммаУпр,2);
				НоваяЗапись.СуммаПродажи=Окр(СтрокаКомплектации.СуммаПродажи,2);
				НоваяЗапись.СуммаПродажиУпр=Окр(СтрокаКомплектации.СуммаПродажиУпр,2);
			Иначе
				НоваяЗапись.Сумма=Окр((СтрокаКомплектации.Сумма/СтрокаКомплектации.Количество)*Количество,2);
				НоваяЗапись.СуммаНДС=Окр((СтрокаКомплектации.СуммаНДС/СтрокаКомплектации.Количество)*Количество,2);
				НоваяЗапись.СуммаУпр=Окр((СтрокаКомплектации.СуммаУпр/СтрокаКомплектации.Количество)*Количество,2);
				НоваяЗапись.СуммаПродажи=Окр((СтрокаКомплектации.СуммаПродажи/СтрокаКомплектации.Количество)*Количество,2);
				НоваяЗапись.СуммаПродажиУпр=Окр((СтрокаКомплектации.СуммаПродажиУпр/СтрокаКомплектации.Количество)*Количество,2);
			КонецЕсли; 
			НоваяЗапись.ХозОперация=ШапкаДокумента.ХозОперация;
			Если СторноПриход Тогда
				НоваяЗапись.Количество		= -НоваяЗапись.Количество;
				НоваяЗапись.Сумма			= -НоваяЗапись.Сумма;
				НоваяЗапись.СуммаНДС		= -НоваяЗапись.СуммаНДС;
				НоваяЗапись.СуммаУпр		= -НоваяЗапись.СуммаУпр;
				НоваяЗапись.СуммаПродажи	= -НоваяЗапись.СуммаПродажи;
				НоваяЗапись.СуммаПродажиУпр	= -НоваяЗапись.СуммаПродажиУпр;
			КонецЕсли;
			Количество=Количество-КоличествоСписания;
			КоличествоУстановлено=КоличествоУстановлено+КоличествоСписания;
			СтрокаКомплектации.Количество=СтрокаКомплектации.Количество-КоличествоСписания;
			Если СтрокаКомплектации.Количество=0 Тогда
				ВыборкаПоКомплектации.Удалить(СтрокаКомплектации);
			КонецЕсли; 
		КонецЦикла; 
		Если Количество>0 Тогда
			Если обЗначениеНеЗаполнено(СтрокаРабот.ХарактеристикаНоменклатуры) Тогда
				дкСообщитьРезультат("Оборудование """+СокрЛП(СтрокаРабот.Номенклатура)+""". Установлено на автомобиль "+СокрЛП(КоличествоУстановлено)+" "+СокрЛП(СтрокаРабот.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Списывается "+СокрЛП(Количество)+" "+СокрЛП(СтрокаРабот.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Превышение "+СокрЛП(Количество-КоличествоУстановлено)+" "+СокрЛП(СтрокаРабот.Номенклатура.ОсновнаяЕдиницаИзмерения),"Важное&Комплектация автомобилей:",ДокументОбъект);
			Иначе
				дкСообщитьРезультат("Оборудование """+СокрЛП(СтрокаРабот.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаРабот.ХарактеристикаНоменклатуры)+""". Установлено на автомобиль "+СокрЛП(КоличествоУстановлено)+" "+СокрЛП(СтрокаРабот.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Списывается "+СокрЛП(Количество)+" "+СокрЛП(СтрокаРабот.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Превышение "+СокрЛП(Количество-КоличествоУстановлено)+" "+СокрЛП(СтрокаРабот.Номенклатура.ОсновнаяЕдиницаИзмерения),"Важное&Комплектация автомобилей:",ДокументОбъект);
			КонецЕсли; 
			ВсеОК=Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	// запись движений
	Если ВсеОК Тогда Записать(); КонецЕсли; 
	
	ДокументОбъект=Неопределено;
	ШапкаДокумента=Неопределено;
	РезультатЗапросаПоРаботам=Неопределено;
	Автомобиль=Неопределено;
	СторноПриход = Неопределено;
	
	Возврат ВсеОК;
КонецФункции

// Предопределенная процедура
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Зарегистрируем изменения для узлов РБД
	орРегистрацияИзменений(ЭтотОбъект);
	
КонецПроцедуры	//	ПриЗаписи()

////////////////////////////////////////////////////////////////////////
//Инициализация переменных модуля набора записей

РежимПроведения=РежимПроведенияДокумента.Оперативный;

ДокументОбъект=Неопределено; // !!! Обязательный к заполнению перед началом проведения
РезультатЗапросаПоРаботам=Неопределено;
Автомобиль=Неопределено;
ПериодДвижения=Неопределено;
ТипОборудования="Автоработы";
СторноПриход = Неопределено;
